## Лабораторна робота № 1. Функція apply
## В лабораторній роботі необхідно виконати наступні дії:
## 1.	Створити матрицю mat з 5 стовпцями та 10 строками за допомогою matrix з випадковими даними (функція rnorm(50)).

mat_1 <- matrix( rnorm(50), ncol=5, nrow=5, byrow=TRUE)

##mat_1
##            [,1]        [,2]        [,3]       [,4]       [,5]
##[1,]  0.08256392 -1.32511989  0.65385456  0.7994584 -1.4045165
##[2,]  0.79080282  1.11120934  0.28354301 -1.6134028  1.2038055
##[3,]  0.89301596 -1.68618479 -0.97966888 -1.1574459 -0.5643490
##[4,]  0.97414078 -0.07550195  0.09640771 -0.4436267  1.0706514
##[5,] -0.05568204 -2.36982212 -0.33472907  1.7164123  0.2537963

##2. Знайти максимальне значення в кожному стовпці.

a <- apply(mat, 2, max)

##a
##[1] 0.9741408 1.1112093 0.6538546 1.7164123 1.2038055

##3.	Знайти середнє (mean) значення кожного стовпця.

b <- apply(mat, 2, mean)

##b
##[1]  0.53696829 -0.86908388 -0.05611853 -0.13972093  0.11187754

##4.	Знайти мінімальне значення в кожному рядку.

c<- apply(mat, 1, min)

##c
##[1] -1.4045165 -1.6134028 -1.6861848 -0.4436267 -2.3698221

##5.	Відсортувати кожен стовбець таблиці.
d <- apply(mat_1, 2, sort)

##d
##            [,1]        [,2]        [,3]       [,4]       [,5]
##[1,] -0.05568204 -2.36982212 -0.97966888 -1.6134028 -1.4045165
##[2,]  0.08256392 -1.68618479 -0.33472907 -1.1574459 -0.5643490
##[3,]  0.79080282 -1.32511989  0.09640771 -0.4436267  0.2537963
##[4,]  0.89301596 -0.07550195  0.28354301  0.7994584  1.0706514
##[5,]  0.97414078  1.11120934  0.65385456  1.7164123  1.2038055

##6.	Знайти кількість значень < 0 для кожного стовпця. Використати свою функцію.

e<- apply(mat, 2, function(x)
                  sum(x<0))

##e
##[1] 1 4 2 3 2

##7.	Вивести вектор з булевими значеннями TRUE та FALSE. TRUE, якщо в стовпці є елементи >2, FALSE – якщо немає.

f<- apply(mat, 2, function(x)
                  any(x > 2))

##f
##[1] FALSE FALSE FALSE FALSE FALSE
